In [1]:
# import numpy module as np
import numpy as np

In [2]:
# import pandas module as pd
import pandas as pd

In [3]:
# initializing the values (given in the question)
data = {
    'EmployeeID': [101, 102, 103, 104, 105],
    'Name': ['John Smith', 'Alice Brown', 'Bob White', 'Emma Green', 'Charlie Red'],
    'Department': ['IT', 'HR', 'IT', 'Finance', 'HR'],
    'Age': [30, 28, 35, 40, 25],
    'Salary': [70000, 60000, 80000, 90000, 55000],
    'JoinDate': ['2018-07-15', '2020-03-10', '2016-11-01', '2012-05-25', '2021-06-01'],
    'ExperienceYears': [5, 3, 7, 11, 2]
}

In [4]:
# initializing the values as a dataframe
df = pd.DataFrame(data)

In [5]:
# displaying the dataframe
df

,EmployeeID,Name,Department,Age,Salary,JoinDate,ExperienceYears
0,101,John Smith,IT,30,70000,2018-07-15,5
1,102,Alice Brown,HR,28,60000,2020-03-10,3
2,103,Bob White,IT,35,80000,2016-11-01,7
3,104,Emma Green,Finance,40,90000,2012-05-25,11
4,105,Charlie Red,HR,25,55000,2021-06-01,2

In [6]:
# a
selected_columns = df[['Name', 'Salary']]
print("Selected Name and Salary Columns:")
print(selected_columns)

Selected Name and Salary Columns:
          Name  Salary
0   John Smith   70000
1  Alice Brown   60000
2    Bob White   80000
3   Emma Green   90000
4  Charlie Red   55000

In [7]:
# b
it_department_employees = df[df['Department'] != 'IT']
print("\nEmployees not in IT department:")
print(it_department_employees)

Employees not in IT department:
   EmployeeID         Name Department  Age  Salary    JoinDate  \
1         102  Alice Brown         HR   28   60000  2020-03-10
3         104   Emma Green    Finance   40   90000  2012-05-25
4         105  Charlie Red         HR   25   55000  2021-06-01

   ExperienceYears
1                3
3               11
4                2

In [8]:
# c 
older_than_30 = df[df['Age'] > 30]
average_salary_by_department = df.groupby('Department')['Salary'].mean()

In [9]:
# d
employee_count_by_department = df['Department'].value_counts()
print("\nNumber of employees in each department:")
print(employee_count_by_department)

Number of employees in each department:
Department
IT         2
HR         2
Finance    1
Name: count, dtype: int64

In [10]:
# e
df['Bonus'] = df['Salary'] * 0.10
print("\nData with Bonus column added:")
print(df)

Data with Bonus column added:
   EmployeeID         Name Department  Age  Salary    JoinDate  \
0         101   John Smith         IT   30   70000  2018-07-15
1         102  Alice Brown         HR   28   60000  2020-03-10
2         103    Bob White         IT   35   80000  2016-11-01
3         104   Emma Green    Finance   40   90000  2012-05-25
4         105  Charlie Red         HR   25   55000  2021-06-01

   ExperienceYears   Bonus
0                5  7000.0
1                3  6000.0
2                7  8000.0
3               11  9000.0
4                2  5500.0

In [11]:
# f
df['Department'] = df['Department'].replace('HR', 'Human Resources')
print("\nUpdated Department column (HR replaced with Human Resources):")
print(df)

Updated Department column (HR replaced with Human Resources):
   EmployeeID         Name       Department  Age  Salary    JoinDate  \
0         101   John Smith               IT   30   70000  2018-07-15
1         102  Alice Brown  Human Resources   28   60000  2020-03-10
2         103    Bob White               IT   35   80000  2016-11-01
3         104   Emma Green          Finance   40   90000  2012-05-25
4         105  Charlie Red  Human Resources   25   55000  2021-06-01

   ExperienceYears   Bonus
0                5  7000.0
1                3  6000.0
2                7  8000.0
3               11  9000.0
4                2  5500.0

In [12]:
# g
df['JoinDate'] = pd.to_datetime(df['JoinDate'])
longest_tenure = df.loc[df['JoinDate'] == df['JoinDate'].min()]
print("\nEmployee(s) with the longest tenure:")
print(longest_tenure)

Employee(s) with the longest tenure:
   EmployeeID        Name Department  Age  Salary   JoinDate  ExperienceYears  \
3         104  Emma Green    Finance   40   90000 2012-05-25               11

    Bonus
3  9000.0

In [13]:
# h
df['SalaryCategory'] = df['Salary'].apply(lambda x: 'High' if x > 75000 else 'Low')
print("\nData with SalaryCategory column:")
print(df)

Data with SalaryCategory column:
   EmployeeID         Name       Department  Age  Salary   JoinDate  \
0         101   John Smith               IT   30   70000 2018-07-15
1         102  Alice Brown  Human Resources   28   60000 2020-03-10
2         103    Bob White               IT   35   80000 2016-11-01
3         104   Emma Green          Finance   40   90000 2012-05-25
4         105  Charlie Red  Human Resources   25   55000 2021-06-01

   ExperienceYears   Bonus SalaryCategory
0                5  7000.0            Low
1                3  6000.0            Low
2                7  8000.0           High
3               11  9000.0           High
4                2  5500.0            Low

In [14]:
# i
df_no_duplicates = df.drop_duplicates(subset='EmployeeID')
print("\nData after removing duplicate EmployeeIDs (if any):")
print(df_no_duplicates)

Data after removing duplicate EmployeeIDs (if any):
   EmployeeID         Name       Department  Age  Salary   JoinDate  \
0         101   John Smith               IT   30   70000 2018-07-15
1         102  Alice Brown  Human Resources   28   60000 2020-03-10
2         103    Bob White               IT   35   80000 2016-11-01
3         104   Emma Green          Finance   40   90000 2012-05-25
4         105  Charlie Red  Human Resources   25   55000 2021-06-01

   ExperienceYears   Bonus SalaryCategory
0                5  7000.0            Low
1                3  6000.0            Low
2                7  8000.0           High
3               11  9000.0           High
4                2  5500.0            Low

In [15]:
# j
median_age = df['Age'].median()
print("\nMedian Age of all employees:", median_age)

Median Age of all employees: 30.0